### Element of Structured Data

Structured data is a tabular format(like a tabular format/like a spreadsheet or database table).It has
1. Rows: Observation or records
2. Columns: Variable or Features

In [3]:
#lets try on titanic dataset
import pandas as pd
df=pd.read_csv("titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
#this above dataset is proper structured dataset as it consist row for records and column for feayures like name,sex,age etc

## DATA TYPES

Data types determine how data is stored, processed and analyzed. There are 2 kinds of data sets. They are:
1. Numeric Data
2. Categorical Data

  Numeric Data:::
Data in numeric form. They are mostly used for calculation of estimate of locations like mean,median, outlier etc.. Numeric data Consist of two   types. They are:
   1. Continuous###:Any value in range, E.g. 24.6,12.3 , Its python data type is float.
   2. Discrete: Integer values, E.g. 3,5,6, Its python data type is Int.

 Categorical Data:::
Data in frequency or countable form. They are for grouping and counting. Categorical data consist of 3 types. They are:
   1. Categorical: Represent categories or grouping. Example: male,Female. Python type: category(in pandas)
   2. Binary: Represent only Two values(True/False). Example: 1 ,0,True,False. Python type: Bool
   3. Ordinal: Represent meaningful order. Example: Rating, Educational level. Python type: Category with ordered=True

In [16]:
#Numeric Data types

#lets try to find continuoos datas from tinanic dataset

In [5]:
cont_data=df['Age']
cont_data.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [22]:
#as we alrady can see Age column is Float python data type.So Age column/feature having continuous data records

In [24]:
#lets try to find  a discrete data from titanic dataset

In [7]:
dis_data=df['Pclass']
dis_data.head()

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [32]:
#as see Pclass column consist int python data types. So Pclass column is discrete data

In [1]:
#Categorical data

In [13]:
category_data=df['Sex']

In [15]:
category_data.head()

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [ ]:
#its still a object type.lets convert in category data type

In [17]:
category_data.astype("category")

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: category
Categories (2, object): ['female', 'male']

In [21]:
#as you can see dtype:category

In [23]:
#Binary

In [25]:
binary_data=df['Survived']

In [27]:
binary_data.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [29]:
#its int type lets convert into bool type
binary_data.astype("bool")

0      False
1       True
2       True
3       True
4      False
       ...
886    False
887     True
888    False
889     True
890    False
Name: Survived, Length: 891, dtype: bool

In [ ]:
#as you see data is converted into True and False

In [31]:
#Ordinal

In [33]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [35]:
#here we can see Pclass is a ordinal data because ticket is has ranking of class 1, class 2, class 3. lets try to on this column

In [45]:
#lets create new dataframe containing 'name' and 'Plcass' only
import pandas as pd
ordinal_data=pd.DataFrame({
    df['Name'],
    df['Pclass']
})

TypeError: unhashable type: 'Series'

In [51]:
#since idea of taking only two series or column because it no hashable. lets try other way by passing dictionary

ordinal_data=pd.DataFrame({
    'Name':df['Name'],
    'Pclass':df['Pclass']
})

In [53]:
ordinal_data.head()

                                                Name  Pclass
0                            Braund, Mr. Owen Harris       3
1  Cumings, Mrs. John Bradley (Florence Briggs Th...       1
2                             Heikkinen, Miss. Laina       3
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)       1
4                           Allen, Mr. William Henry       3

In [67]:
#lets convert to ordinal categorial data
convert_ordinal=ordinal_data['Pclass']=pd.Categorical(df['Pclass'],categories=[1,2,3],ordered=True)
print(convert_ordinal)

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1 < 2 < 3]

In [69]:
type(convert_ordinal)

pandas.core.arrays.categorical.Categorical